HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F2xx_DFP.2.5.0.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.1.1" condition="STM32F2 CMSIS HAL">  <!-- Cversion is necessary -->
      <description>System Startup for STMicroelectronics STM32F2 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_STM32F2XX    /* Device Startup for STM32F2 */
      </RTE_Components_h>

      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32F2xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <file category="source" condition="STM32F2_ARMCC"  name="MDK/Device/Source/ARM/STM32F2xx_OPT.s"  attr="template"  select="Flash Option Bytes"/>
        <file category="source" condition="STM32F2_ARMCC"  name="MDK/Device/Source/ARM/STM32F2xx_OTP.s"  attr="template"  select="Flash One-Time programmable Bytes"/>
        
        <file category="header" name="Drivers/CMSIS/Device/ST/STM32F2xx/Include/stm32f2xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32F205xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f205xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F207xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f207xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F215xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f215xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F217xx_ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/arm/startup_stm32f217xx.s" attr="config" version="2.1.1"/>
        <!-- GCC Toolchain -->
        <file category="source" condition="STM32F205xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f205xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F207xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f207xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F215xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f215xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F217xx_GCC"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/gcc/startup_stm32f217xx.s" attr="config" version="2.1.1"/>
        <!-- IAR Toolchain -->
        <file category="source" condition="STM32F205xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f205xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F207xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f207xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F215xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f215xx.s" attr="config" version="2.1.1"/>
        <file category="source" condition="STM32F217xx_IAR"    name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/iar/startup_stm32f217xx.s" attr="config" version="2.1.1"/>

        <!-- system file -->
        <file category="source" name="Drivers/CMSIS/Device/ST/STM32F2xx/Source/Templates/system_stm32f2xx.c" attr="config" version="2.1.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube Framework" Csub="Classic" Cversion="1.1.1" condition="STM32F2 Framework Classic">
      <description>Configuration via RTE_Device.h</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CLASSIC
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/classic.html"/>
        <file category="header"  name="CMSIS/Driver/Config/RTE_Device.h" attr="config" version="2.2"/>
        <file category="header"  name="MDK/Templates/Inc/stm32f2xx_hal_conf.h" attr="config"/>
        <file category="source"  name="MDK/Templates/Src/stm32f2xx_hal_msp.c"  attr="template" select="MCU Specific HAL Initialization / De-Initialization"/>
        <file category="header"  name="MDK/Templates/Inc/stm32f2xx_it.h" attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="source"  name="MDK/Templates/Src/stm32f2xx_it.c" attr="template" select="Exception Handlers and Peripheral IRQ"/>
        <file category="header"  name="MDK/Templates/Inc/main.h" attr="template" select="'main' module for STM32Cube"/>
        <file category="source"  name="MDK/Templates/Src/main.c" attr="template" select="'main' module for STM32Cube"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" condition="STM32F2">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <!-- this component will be replaced by the component described in gpdsc from generator -->
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0"/>
        <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.1"/>
      </files>
    </component>

    <!-- START: STMicroelectronics STM32CubeF2 HAL -->

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common" Cversion="1.1.1" condition="STM32F2 HAL Common">
      <description>Common HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COMMON
      </RTE_Components_h>
      <files>
        <file category="include" name="Drivers/STM32F2xx_HAL_Driver/Inc/"/>
        <file category="header"  name="Drivers/STM32F2xx_HAL_Driver/Inc/stm32f2xx_hal.h"/>
        <file category="source"  name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC" Cversion="1.1.1" condition="STM32F2 HAL DMA">
      <description>Analog-to-digital converter (ADC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_adc.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_adc_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CAN" Cversion="1.1.1" condition="STM32F2 HAL">
      <description>Controller area network (CAN) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CAN
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_can.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex" Cversion="1.1.1" condition="STM32F2 HAL">
      <description>Cortex HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CORTEX
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_cortex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRC" Cversion="1.1.1" condition="STM32F2 HAL">
      <description>CRC calculation unit (CRC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_crc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="CRYP" Cversion="1.1.1" condition="STM32F21x HAL DMA">
      <description>Cryptographic processor (CRYP) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRYP
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_cryp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DAC" Cversion="1.1.1" condition="STM32F2 HAL DMA">
      <description>Digital-to-analog converter (DAC) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dac.c"/>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dac_ex.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI" Cversion="1.1.1" condition="STM32F2x7 HAL DMA">
      <description>Digital camera interface (DCMI) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DCMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32F2xx_HAL_Driver/Src/stm32f2xx_hal_dcmi.c"/>
      </files>
    </component>

