HashDefineElectronics/Reflow-O-Matic/Packages/.cache/Keil.STM32F2xx_DFP.2.5.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="2.5" condition="STM32F2 CMSIS_Driver USART">
      <description>USART Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
        #define RTE_Drivers_USART6              /* Driver USART6 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USART_STM32F2xx.c"/>
      </files>
    </component>
    
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="2.5" condition="STM32F2 CMSIS_Driver I2C">
      <description>I2C Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="2.5" condition="STM32F2 CMSIS_Driver MCI">
      <description>MCI Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.5" condition="STM32F2 CMSIS_Driver ETH_MAC">
      <description>Ethernet MAC Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/EMAC_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1" Cversion="2.12" condition="STM32F2 CMSIS_Driver USB0">
      <description>USB Device Full-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_FS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="High-speed" Capiversion="2.1" Cversion="2.12" condition="STM32F2 CMSIS_Driver USB1">
      <description>USB Device High-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_HS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="Full-speed" Capiversion="2.0" Cversion="2.16" condition="STM32F2 CMSIS_Driver USB0">
      <description>USB Host Full-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_FS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_FS_STM32F2xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="High-speed" Capiversion="2.0" Cversion="2.17" condition="STM32F2 CMSIS_Driver USB1">
      <description>USB Host High-Speed Driver for STM32F2 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_HS_STM32F2xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS_STM32F2xx.c"/>
      </files>
    </component>

    <!-- MCBSTM32F200 Development Board -->
    <bundle Cbundle="MCBSTM32F200" Cclass="Board Support" Cversion="2.0.0">
      <description>Keil Development Board MCBSTM32F200</description>
      <doc>MDK/Boards/Keil/MCBSTM32F200/Documentation/mcbstm32f200.chm</doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32F2 HAL GPIO">
        <description>LED Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/LED_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32F2 HAL GPIO">
        <description>Buttons Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Buttons_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.00" condition="STM32F2 HAL GPIO ADC">
        <description>A/D Converter Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/ADC_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.00" condition="STM32F2 CMSIS RTOS I2C_Driver">
        <description>Joystick Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Joystick_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen" Capiversion="1.00" condition="STM32F2 CMSIS RTOS I2C_Driver">
        <description>Touchscreen Interface for STMPE811</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Touch_STMPE811.c"/>
        </files>
      </component>
      <component Cgroup="Accelerometer" Capiversion="1.00" condition="STM32F2 CMSIS I2C_Driver">
        <description>Accelerometer Interface for LIS3DH</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Accelerometer_LIS3DH.c"/>
        </files>
      </component>
      <component Cgroup="Gyroscope" Capiversion="1.00" condition="STM32F2 CMSIS I2C_Driver">
        <description>Gyroscope Interface for L3G4200D</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Gyroscope_L3G4200D.c"/>
        </files>
      </component>
      <component Cgroup="Camera" Capiversion="1.00" condition="STM32F2 HAL GPIO DMA DCMI I2C_Driver">
        <description>Camera Interface for OVM7690</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/Camera_OVM7690.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.00" condition="STM32F2 HAL GPIO SRAM">
        <description>Graphic LCD Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="header" name="MDK/Boards/Keil/MCBSTM32F200/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/GLCD_MCBSTM32F200.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD" Capiversion="1.1" Cvariant="16-bit IF" condition="STM32F2 HAL GPIO SRAM LCD_16">
        <description>emWin LCD 16-bit Interface for Keil MCBSTM32F200 Development Board</description>
        <files>
          <file category="source" name="MDK/Boards/Keil/MCBSTM32F200/Common/LCD_X.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
